brew "bat"
brew "docker"
brew "docker-compose"
brew "grpcurl"
brew "kubelogin"
brew "libfido2"
brew "mise"
brew "neovim"
brew "openssh"
brew "openvpn"
brew "postgresql@17", restart_service: :changed
brew "ripgrep"
brew "rust"
brew "tmux"
brew "tokei"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "claude-code"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "ghostty"
cask "visual-studio-code"
vscode "drblury.protobuf-vsc"
vscode "golang.go"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "waderyan.gitblame"
