tap "homebrew/bundle"
tap "homebrew/services"
brew "bat"
brew "dbmate"
brew "docker"
brew "go"
brew "minikube"
brew "neovim"
brew "node"
brew "openfortivpn"
brew "pnpm"
brew "podman"
brew "postgresql@17", link: true
brew "protobuf"
brew "ripgrep"
brew "sqlc"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
vscode "astro-build.astro-vscode"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "metaphore.kanagawa-vscode-color-theme"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "zxh404.vscode-proto3"
