tap "homebrew/bundle"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node", link: false
# Fast, disk space efficient package manager
brew "pnpm"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql@17", restart_service: true
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Shell extension to navigate your filesystem faster
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "metaphore.kanagawa-vscode-color-theme"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
vscode "zxh404.vscode-proto3"
